app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "333"], ["text", "asdfadfaf"], ["created_at", "2016-07-10 13:21:15.412909"], ["updated_at", "2016-07-10 13:21:15.412909"]]
---
  def create
    @article = Article.new(article_params)
    if @article.valid?
      @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "as"], ["updated_at", "2016-07-10 16:17:07.296133"], ["id", 2]]
---
  def update
    @article = Article.find(params[:id])
    if @article.valid?
      @article.update(article_params)