app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "123123"], ["message", "asdasdadasd"], ["created_at", "2016-07-06 07:42:29.911060"], ["updated_at", "2016-07-06 07:42:29.911060"]]
---
  def create
    @contact = Contact.new(contact_params)
    @contact.save